[Survived] LogicalOperator
src/lib/registry-client.ts:1:22
-const REGISTRY_URL = import.meta.env.REGISTRY_URL ?? "http://localhost:5000"
+const REGISTRY_URL = import.meta.env.REGISTRY_URL && "http://localhost:5000"
 
 const MANIFEST_ACCEPT =

[Survived] StringLiteral
src/lib/registry-client.ts:1:54
-const REGISTRY_URL = import.meta.env.REGISTRY_URL ?? "http://localhost:5000"
+const REGISTRY_URL = import.meta.env.REGISTRY_URL ?? ""
 
 const MANIFEST_ACCEPT =

[Survived] StringLiteral
src/lib/registry-client.ts:4:3
 const REGISTRY_URL = import.meta.env.REGISTRY_URL ?? "http://localhost:5000"
 
 const MANIFEST_ACCEPT =
-  "application/vnd.docker.distribution.manifest.v2+json, application/vnd.oci.image.manifest.v1+json, application/vnd.docker.distribution.manifest.list.v2+json, application/vnd.oci.image.index.v1+json"
+  ""
 
 async function registryFetch(path: string, options?: RequestInit) {

[Killed] BlockStatement
src/lib/registry-client.ts:6:67
 const MANIFEST_ACCEPT =
   "application/vnd.docker.distribution.manifest.v2+json, application/vnd.oci.image.manifest.v1+json, application/vnd.docker.distribution.manifest.list.v2+json, application/vnd.oci.image.index.v1+json"
 
-async function registryFetch(path: string, options?: RequestInit) {
-  const url = `${REGISTRY_URL}/v2${path}`
-  return fetch(url, {
-    ...options,
-    headers: {
-      Accept: MANIFEST_ACCEPT,
-      ...(options?.headers ?? {}),
-    },
-  })
-}
+async function registryFetch(path: string, options?: RequestInit) {}
 
 export async function listRepositories(): Promise<string[]> {
killedBy: registry-client listRepositories returns repos on ok response
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ObjectLiteral
src/lib/registry-client.ts:8:21
 
 async function registryFetch(path: string, options?: RequestInit) {
   const url = `${REGISTRY_URL}/v2${path}`
-  return fetch(url, {
-    ...options,
-    headers: {
-      Accept: MANIFEST_ACCEPT,
-      ...(options?.headers ?? {}),
-    },
-  })
+  return fetch(url, {})
 }
 
killedBy: registry-client getManifestDigest calls fetch with HEAD method
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   Any<String>,

[Killed] OptionalChaining
src/lib/registry-client.ts:12:11
     ...options,
     headers: {
       Accept: MANIFEST_ACCEPT,
-      ...(options?.headers ?? {}),
+      ...(options.headers ?? {}),
     },
   })
killedBy: registry-client listRepositories returns repos on ok response
statusReason: Cannot read properties of undefined (reading 'headers')

[Survived] LogicalOperator
src/lib/registry-client.ts:12:11
     ...options,
     headers: {
       Accept: MANIFEST_ACCEPT,
-      ...(options?.headers ?? {}),
+      ...(options?.headers && {}),
     },
   })

[Killed] BlockStatement
src/lib/registry-client.ts:17:61
   })
 }
 
-export async function listRepositories(): Promise<string[]> {
-  const res = await registryFetch("/_catalog?n=1000")
-  if (!res.ok) return []
-  const data = await res.json()
-  return (data.repositories as string[]) ?? []
-}
+export async function listRepositories(): Promise<string[]> {}
 
 export async function listTags(name: string): Promise<string[]> {
killedBy: registry-client listRepositories returns repos on ok response
statusReason: expected undefined to deeply equal [ 'repo1', 'repo2' ]

[Killed] StringLiteral
src/lib/registry-client.ts:18:35
 }
 
 export async function listRepositories(): Promise<string[]> {
-  const res = await registryFetch("/_catalog?n=1000")
+  const res = await registryFetch("")
   if (!res.ok) return []
   const data = await res.json()
killedBy: registry-client listRepositories calls correct URL path
statusReason: expected 'http://localhost:5000/v2' to contain '/v2/_catalog?n=1000'

[Killed] BooleanLiteral
src/lib/registry-client.ts:19:7
 
 export async function listRepositories(): Promise<string[]> {
   const res = await registryFetch("/_catalog?n=1000")
-  if (!res.ok) return []
+  if (res.ok) return []
   const data = await res.json()
   return (data.repositories as string[]) ?? []
killedBy: registry-client listRepositories returns repos on ok response
statusReason: expected [] to deeply equal [ 'repo1', 'repo2' ]

[Killed] ConditionalExpression
src/lib/registry-client.ts:19:7
 
 export async function listRepositories(): Promise<string[]> {
   const res = await registryFetch("/_catalog?n=1000")
-  if (!res.ok) return []
+  if (true) return []
   const data = await res.json()
   return (data.repositories as string[]) ?? []
killedBy: registry-client listRepositories returns repos on ok response
statusReason: expected [] to deeply equal [ 'repo1', 'repo2' ]

[Killed] LogicalOperator
src/lib/registry-client.ts:21:10
   const res = await registryFetch("/_catalog?n=1000")
   if (!res.ok) return []
   const data = await res.json()
-  return (data.repositories as string[]) ?? []
+  return data.repositories as string[] && []
 }
 
killedBy: registry-client listRepositories returns repos on ok response
statusReason: expected [] to deeply equal [ 'repo1', 'repo2' ]

[Killed] BlockStatement
src/lib/registry-client.ts:24:65
   return (data.repositories as string[]) ?? []
 }
 
-export async function listTags(name: string): Promise<string[]> {
-  const res = await registryFetch(`/${name}/tags/list`)
-  if (!res.ok) return []
-  const data = await res.json()
-  return (data.tags as string[]) ?? []
-}
+export async function listTags(name: string): Promise<string[]> {}
 
 export async function getManifest(name: string, reference: string) {
killedBy: registry-client listTags returns tags on ok response
statusReason: expected undefined to deeply equal [ 'latest', 'v1.0' ]

[Survived] StringLiteral
src/lib/registry-client.ts:25:35
 }
 
 export async function listTags(name: string): Promise<string[]> {
-  const res = await registryFetch(`/${name}/tags/list`)
+  const res = await registryFetch(``)
   if (!res.ok) return []
   const data = await res.json()

[Killed] BooleanLiteral
src/lib/registry-client.ts:26:7
 
 export async function listTags(name: string): Promise<string[]> {
   const res = await registryFetch(`/${name}/tags/list`)
-  if (!res.ok) return []
+  if (res.ok) return []
   const data = await res.json()
   return (data.tags as string[]) ?? []
killedBy: registry-client listTags returns tags on ok response
statusReason: expected [] to deeply equal [ 'latest', 'v1.0' ]

[Killed] ConditionalExpression
src/lib/registry-client.ts:26:7
 
 export async function listTags(name: string): Promise<string[]> {
   const res = await registryFetch(`/${name}/tags/list`)
-  if (!res.ok) return []
+  if (true) return []
   const data = await res.json()
   return (data.tags as string[]) ?? []
killedBy: registry-client listTags returns tags on ok response
statusReason: expected [] to deeply equal [ 'latest', 'v1.0' ]

[Killed] LogicalOperator
src/lib/registry-client.ts:28:10
   const res = await registryFetch(`/${name}/tags/list`)
   if (!res.ok) return []
   const data = await res.json()
-  return (data.tags as string[]) ?? []
+  return data.tags as string[] && []
 }
 
killedBy: registry-client listTags returns tags on ok response
statusReason: expected [] to deeply equal [ 'latest', 'v1.0' ]

[Killed] ArrayDeclaration
src/lib/registry-client.ts:28:37
   const res = await registryFetch(`/${name}/tags/list`)
   if (!res.ok) return []
   const data = await res.json()
-  return (data.tags as string[]) ?? []
+  return (data.tags as string[]) ?? ["Stryker was here"]
 }
 
killedBy: registry-client listTags returns [] when tags key missing
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/lib/registry-client.ts:31:68
   return (data.tags as string[]) ?? []
 }
 
-export async function getManifest(name: string, reference: string) {
-  return registryFetch(`/${name}/manifests/${reference}`)
-}
+export async function getManifest(name: string, reference: string) {}
 
 export async function getManifestDigest(name: string, reference: string): Promise<string | null> {
killedBy: registry-client getManifest returns the raw fetch response
statusReason: expected undefined to be { ok: true, …(2) } // Object.is equality

[Killed] BlockStatement
src/lib/registry-client.ts:35:98
   return registryFetch(`/${name}/manifests/${reference}`)
 }
 
-export async function getManifestDigest(name: string, reference: string): Promise<string | null> {
-  const res = await registryFetch(`/${name}/manifests/${reference}`, { method: "HEAD" })
-  return res.headers.get("Docker-Content-Digest")
-}
+export async function getManifestDigest(name: string, reference: string): Promise<string | null> {}
 
 export async function deleteManifest(name: string, digest: string) {
killedBy: registry-client getManifestDigest returns digest header value
statusReason: expected undefined to be 'sha256:abc123' // Object.is equality

[Killed] BlockStatement
src/lib/registry-client.ts:40:68
   return res.headers.get("Docker-Content-Digest")
 }
 
-export async function deleteManifest(name: string, digest: string) {
-  return registryFetch(`/${name}/manifests/${digest}`, { method: "DELETE" })
-}
+export async function deleteManifest(name: string, digest: string) {}
 
 export async function proxyRegistryRequest(path: string, init?: RequestInit) {
killedBy: registry-client deleteManifest calls fetch with DELETE method
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/lib/registry-client.ts:44:78
   return registryFetch(`/${name}/manifests/${digest}`, { method: "DELETE" })
 }
 
-export async function proxyRegistryRequest(path: string, init?: RequestInit) {
-  return registryFetch(path, init)
-}
+export async function proxyRegistryRequest(path: string, init?: RequestInit) {}
 
killedBy: registry-client proxyRegistryRequest passes through to registryFetch with Accept header
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
