[Killed] BlockStatement
src/lib/auth.ts:6:22
 
 const SESSION_EXPIRY = "8h"
 
-function getSecret() {
-  const secret = import.meta.env.SESSION_SECRET
-  if (!secret) throw new Error("SESSION_SECRET env var is required")
-  return new TextEncoder().encode(secret)
-}
+function getSecret() {}
 
 export async function createSessionToken(
killedBy: auth createSessionToken returns a JWT string
statusReason: Key for the HS256 algorithm must be one of type CryptoKey, KeyObject, JSON Web Key, or Uint8Array. Received undefined

[Killed] ConditionalExpression
src/lib/auth.ts:8:7
 
 function getSecret() {
   const secret = import.meta.env.SESSION_SECRET
-  if (!secret) throw new Error("SESSION_SECRET env var is required")
+  if (false) throw new Error("SESSION_SECRET env var is required")
   return new TextEncoder().encode(secret)
 }
killedBy: auth getSecret — missing env var throws when SESSION_SECRET is absent
statusReason: expected [Function] to throw error including 'SESSION_SECRET env var is required' but got 'Zero-length key is not supported'

[Killed] BooleanLiteral
src/lib/auth.ts:8:7
 
 function getSecret() {
   const secret = import.meta.env.SESSION_SECRET
-  if (!secret) throw new Error("SESSION_SECRET env var is required")
+  if (secret) throw new Error("SESSION_SECRET env var is required")
   return new TextEncoder().encode(secret)
 }
killedBy: auth createSessionToken returns a JWT string
statusReason: SESSION_SECRET env var is required

[Killed] BlockStatement
src/lib/auth.ts:14:20
 
 export async function createSessionToken(
   payload: Omit<SessionPayload, "iat" | "exp">,
-): Promise<string> {
-  return new SignJWT({ ...payload })
-    .setProtectedHeader({ alg: "HS256" })
-    .setIssuedAt()
-    .setExpirationTime(SESSION_EXPIRY)
-    .sign(getSecret())
-}
+): Promise<string> {}
 
 export async function verifySessionToken(token: string): Promise<SessionPayload> {
killedBy: auth createSessionToken returns a JWT string
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/lib/auth.ts:22:82
     .sign(getSecret())
 }
 
-export async function verifySessionToken(token: string): Promise<SessionPayload> {
-  const { payload } = await jwtVerify(token, getSecret())
-  return payload as unknown as SessionPayload
-}
+export async function verifySessionToken(token: string): Promise<SessionPayload> {}
 
 export function setSessionCookie(cookies: AstroCookies, token: string) {
killedBy: auth verifySessionToken round-trips a valid token
statusReason: Cannot read properties of undefined (reading 'sub')

[Killed] BlockStatement
src/lib/auth.ts:27:72
   return payload as unknown as SessionPayload
 }
 
-export function setSessionCookie(cookies: AstroCookies, token: string) {
-  cookies.set("session", token, {
-    httpOnly: true,
-    secure: import.meta.env.PROD,
-    sameSite: "lax",
-    path: "/",
-    maxAge: 60 * 60 * 8,
-  })
-}
+export function setSessionCookie(cookies: AstroCookies, token: string) {}
 
 export function clearSessionCookie(cookies: AstroCookies) {
killedBy: auth setSessionCookie calls cookies.set with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', 'my-token', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/lib/auth.ts:28:33
 }
 
 export function setSessionCookie(cookies: AstroCookies, token: string) {
-  cookies.set("session", token, {
-    httpOnly: true,
-    secure: import.meta.env.PROD,
-    sameSite: "lax",
-    path: "/",
-    maxAge: 60 * 60 * 8,
-  })
+  cookies.set("session", token, {})
 }
 
killedBy: auth setSessionCookie calls cookies.set with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', 'my-token', …(1) ]

Received:

  1st vi.fn() call:

  [
    "session",

[Killed] StringLiteral
src/lib/auth.ts:28:15
 }
 
 export function setSessionCookie(cookies: AstroCookies, token: string) {
-  cookies.set("session", token, {
+  cookies.set("", token, {
     httpOnly: true,
     secure: import.meta.env.PROD,
killedBy: auth setSessionCookie calls cookies.set with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', 'my-token', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "session",

[Killed] BooleanLiteral
src/lib/auth.ts:29:15
 
 export function setSessionCookie(cookies: AstroCookies, token: string) {
   cookies.set("session", token, {
-    httpOnly: true,
+    httpOnly: false,
     secure: import.meta.env.PROD,
     sameSite: "lax",
killedBy: auth setSessionCookie calls cookies.set with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', 'my-token', …(1) ]

Received:

  1st vi.fn() call:

  [
    "session",

[Killed] StringLiteral
src/lib/auth.ts:31:15
   cookies.set("session", token, {
     httpOnly: true,
     secure: import.meta.env.PROD,
-    sameSite: "lax",
+    sameSite: "",
     path: "/",
     maxAge: 60 * 60 * 8,
killedBy: auth setSessionCookie calls cookies.set with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', 'my-token', …(1) ]

Received:

  1st vi.fn() call:

  [
    "session",

[Killed] ArithmeticOperator
src/lib/auth.ts:33:13
     secure: import.meta.env.PROD,
     sameSite: "lax",
     path: "/",
-    maxAge: 60 * 60 * 8,
+    maxAge: 60 * 60 / 8,
   })
 }
killedBy: auth setSessionCookie calls cookies.set with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', 'my-token', …(1) ]

Received:

  1st vi.fn() call:

  [
    "session",

[Killed] ArithmeticOperator
src/lib/auth.ts:33:13
     secure: import.meta.env.PROD,
     sameSite: "lax",
     path: "/",
-    maxAge: 60 * 60 * 8,
+    maxAge: 60 / 60 * 8,
   })
 }
killedBy: auth setSessionCookie calls cookies.set with correct options
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', 'my-token', …(1) ]

Received:

  1st vi.fn() call:

  [
    "session",

[Killed] BlockStatement
src/lib/auth.ts:37:59
   })
 }
 
-export function clearSessionCookie(cookies: AstroCookies) {
-  cookies.delete("session", { path: "/" })
-}
+export function clearSessionCookie(cookies: AstroCookies) {}
 
killedBy: auth clearSessionCookie calls cookies.delete with path /
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', { path: '/' } ]

Number of calls: 0

[Killed] ObjectLiteral
src/lib/auth.ts:38:29
 }
 
 export function clearSessionCookie(cookies: AstroCookies) {
-  cookies.delete("session", { path: "/" })
+  cookies.delete("session", {})
 }
 
killedBy: auth clearSessionCookie calls cookies.delete with path /
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', { path: '/' } ]

Received:

  1st vi.fn() call:

  [
    "session",
