[Killed] BlockStatement
src/lib/audit.ts:9:4
   action: string
   resource: string | null
   ipAddress: string | null
-}) {
-  db.insert(auditLog)
-    .values(entry)
-    .execute()
-    .catch((e) => {
-      console.error("Audit log write failed:", e)
-    })
-}
+}) {}
 
killedBy: writeAuditLog calls db.insert with the entry
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/lib/audit.ts:13:19
   db.insert(auditLog)
     .values(entry)
     .execute()
-    .catch((e) => {
-      console.error("Audit log write failed:", e)
-    })
+    .catch((e) => {})
 }
 
killedBy: writeAuditLog logs error to console on execute failure, does not throw
statusReason: expected "error" to be called with arguments: [ 'Audit log write failed:', …(1) ]

Number of calls: 0
