[Killed] ArithmeticOperator
src/lib/registry-sync.ts:6:28
 import { listRepositories, listTags, getManifest } from "./registry-client"
 import { eq, sql } from "drizzle-orm"
 
-const STALE_THRESHOLD_MS = 5 * 60 * 1000 // 5 minutes
+const STALE_THRESHOLD_MS = 5 / 60 * 1000 // 5 minutes
 
 function isStale(date: Date | null | undefined): boolean {
killedBy: syncRepository returns early when repo is not stale (synced recently)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "myrepo",

[Killed] ArithmeticOperator
src/lib/registry-sync.ts:6:28
 import { listRepositories, listTags, getManifest } from "./registry-client"
 import { eq, sql } from "drizzle-orm"
 
-const STALE_THRESHOLD_MS = 5 * 60 * 1000 // 5 minutes
+const STALE_THRESHOLD_MS = 5 * 60 / 1000 // 5 minutes
 
 function isStale(date: Date | null | undefined): boolean {
killedBy: syncRepository returns early when repo is not stale (synced recently)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "myrepo",

[Killed] BlockStatement
src/lib/registry-sync.ts:8:58
 
 const STALE_THRESHOLD_MS = 5 * 60 * 1000 // 5 minutes
 
-function isStale(date: Date | null | undefined): boolean {
-  if (!date) return true
-  return Date.now() - date.getTime() > STALE_THRESHOLD_MS
-}
+function isStale(date: Date | null | undefined): boolean {}
 
 /** Sync repository list from registry → PG. Fast: one registry API call. */
killedBy: syncRepository syncs when lastSyncedAt is null (missing entry)
statusReason: expected "vi.fn()" to be called with arguments: [ 'myrepo' ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/registry-sync.ts:9:7
 const STALE_THRESHOLD_MS = 5 * 60 * 1000 // 5 minutes
 
 function isStale(date: Date | null | undefined): boolean {
-  if (!date) return true
+  if (true) return true
   return Date.now() - date.getTime() > STALE_THRESHOLD_MS
 }
killedBy: syncRepository returns early when repo is not stale (synced recently)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "myrepo",

[Killed] BooleanLiteral
src/lib/registry-sync.ts:9:21
 const STALE_THRESHOLD_MS = 5 * 60 * 1000 // 5 minutes
 
 function isStale(date: Date | null | undefined): boolean {
-  if (!date) return true
+  if (!date) return false
   return Date.now() - date.getTime() > STALE_THRESHOLD_MS
 }
killedBy: syncRepository syncs when lastSyncedAt is null (missing entry)
statusReason: expected "vi.fn()" to be called with arguments: [ 'myrepo' ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/registry-sync.ts:10:10
 
 function isStale(date: Date | null | undefined): boolean {
   if (!date) return true
-  return Date.now() - date.getTime() > STALE_THRESHOLD_MS
+  return false
 }
 
killedBy: syncRepository syncs when lastSyncedAt is older than 5 minutes
statusReason: expected "vi.fn()" to be called with arguments: [ 'myrepo' ]

Number of calls: 0

[Killed] ArithmeticOperator
src/lib/registry-sync.ts:10:10
 
 function isStale(date: Date | null | undefined): boolean {
   if (!date) return true
-  return Date.now() - date.getTime() > STALE_THRESHOLD_MS
+  return Date.now() + date.getTime() > STALE_THRESHOLD_MS
 }
 
killedBy: syncRepository returns early when repo is not stale (synced recently)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "myrepo",

[Killed] BlockStatement
src/lib/registry-sync.ts:14:57
 }
 
 /** Sync repository list from registry → PG. Fast: one registry API call. */
-export async function syncRepositories(): Promise<void> {
-  const names = await listRepositories()
-  if (names.length === 0) return
-
-  await db
-    .insert(repositories)
-    .values(names.map((name) => ({ name, lastSyncedAt: new Date() })))
-    .onConflictDoUpdate({
-      target: repositories.name,
-      set: { lastSyncedAt: new Date() },
-    })
-}
+export async function syncRepositories(): Promise<void> {}
 
 /**
killedBy: syncRepositories upserts repository rows when names returned
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/lib/registry-sync.ts:16:7
 /** Sync repository list from registry → PG. Fast: one registry API call. */
 export async function syncRepositories(): Promise<void> {
   const names = await listRepositories()
-  if (names.length === 0) return
+  if (names.length !== 0) return
 
   await db
killedBy: syncRepositories does nothing when registry returns empty list
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/lib/registry-sync.ts:16:7
 /** Sync repository list from registry → PG. Fast: one registry API call. */
 export async function syncRepositories(): Promise<void> {
   const names = await listRepositories()
-  if (names.length === 0) return
+  if (false) return
 
   await db
killedBy: syncRepositories does nothing when registry returns empty list
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ArrowFunction
src/lib/registry-sync.ts:20:23
 
   await db
     .insert(repositories)
-    .values(names.map((name) => ({ name, lastSyncedAt: new Date() })))
+    .values(names.map(() => undefined))
     .onConflictDoUpdate({
       target: repositories.name,
killedBy: syncRepositories upserts repository rows when names returned
statusReason: expected "vi.fn()" to be called with arguments: [ ArrayContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ArrayContaining [

[Killed] ConditionalExpression
src/lib/registry-sync.ts:38:7
     .where(eq(repositories.name, name))
     .limit(1)
 
-  if (!isStale(existing?.lastSyncedAt)) return
+  if (false) return
 
   const tags = await listTags(name)
killedBy: syncRepository returns early when repo is not stale (synced recently)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "myrepo",

[Killed] ConditionalExpression
src/lib/registry-sync.ts:38:7
     .where(eq(repositories.name, name))
     .limit(1)
 
-  if (!isStale(existing?.lastSyncedAt)) return
+  if (true) return
 
   const tags = await listTags(name)
killedBy: syncRepository syncs when lastSyncedAt is null (missing entry)
statusReason: expected "vi.fn()" to be called with arguments: [ 'myrepo' ]

Number of calls: 0

[Killed] ArrowFunction
src/lib/registry-sync.ts:43:17
   const tags = await listTags(name)
 
   // Fetch manifests in parallel (max 8 concurrent)
-  const chunk = (arr: string[], size: number) =>
-    Array.from({ length: Math.ceil(arr.length / size) }, (_, i) =>
-      arr.slice(i * size, i * size + size),
-    )
+  const chunk = () => undefined
 
   let totalSize = 0
killedBy: syncRepository syncs when lastSyncedAt is null (missing entry)
statusReason: chunk is not a function or its return value is not iterable

[Killed] ArrowFunction
src/lib/registry-sync.ts:44:58
 
   // Fetch manifests in parallel (max 8 concurrent)
   const chunk = (arr: string[], size: number) =>
-    Array.from({ length: Math.ceil(arr.length / size) }, (_, i) =>
-      arr.slice(i * size, i * size + size),
+    Array.from({ length: Math.ceil(arr.length / size) }, () => undefined,
     )
 
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: Cannot read properties of undefined (reading 'map')

[Survived] ArithmeticOperator
src/lib/registry-sync.ts:44:36
 
   // Fetch manifests in parallel (max 8 concurrent)
   const chunk = (arr: string[], size: number) =>
-    Array.from({ length: Math.ceil(arr.length / size) }, (_, i) =>
+    Array.from({ length: Math.ceil(arr.length * size) }, (_, i) =>
       arr.slice(i * size, i * size + size),
     )

[Killed] ArithmeticOperator
src/lib/registry-sync.ts:45:27
   // Fetch manifests in parallel (max 8 concurrent)
   const chunk = (arr: string[], size: number) =>
     Array.from({ length: Math.ceil(arr.length / size) }, (_, i) =>
-      arr.slice(i * size, i * size + size),
+      arr.slice(i * size, i * size - size),
     )
 
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] MethodExpression
src/lib/registry-sync.ts:45:7
   // Fetch manifests in parallel (max 8 concurrent)
   const chunk = (arr: string[], size: number) =>
     Array.from({ length: Math.ceil(arr.length / size) }, (_, i) =>
-      arr.slice(i * size, i * size + size),
+      arr,
     )
 
killedBy: syncRepository processes tags in batches (more than 8 tags)
statusReason: expected "vi.fn()" to be called 10 times, but got 20 times

[Killed] ArrayDeclaration
src/lib/registry-sync.ts:49:59
     )
 
   let totalSize = 0
-  const metaRows: (typeof imageMetadata.$inferInsert)[] = []
+  const metaRows: (typeof imageMetadata.$inferInsert)[] = ["Stryker was here"]
 
   for (const batch of chunk(tags, 8)) {
killedBy: syncRepository skips imageMetadata upsert when no tags
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/lib/registry-sync.ts:53:32
 
   for (const batch of chunk(tags, 8)) {
     const results = await Promise.allSettled(
-      batch.map(async (tag) => {
-        const res = await getManifest(name, tag)
-        if (!res.ok) return null
-        const manifest: Record<string, unknown> = await res.json()
-        return { tag, manifest }
-      }),
+      batch.map(async (tag) => {}),
     )
 
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/lib/registry-sync.ts:55:13
     const results = await Promise.allSettled(
       batch.map(async (tag) => {
         const res = await getManifest(name, tag)
-        if (!res.ok) return null
+        if (false) return null
         const manifest: Record<string, unknown> = await res.json()
         return { tag, manifest }
killedBy: syncRepository skips tags with non-ok manifest responses
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/lib/registry-sync.ts:55:13
     const results = await Promise.allSettled(
       batch.map(async (tag) => {
         const res = await getManifest(name, tag)
-        if (!res.ok) return null
+        if (true) return null
         const manifest: Record<string, unknown> = await res.json()
         return { tag, manifest }
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/lib/registry-sync.ts:61:35
       }),
     )
 
-    for (const result of results) {
-      if (result.status !== "fulfilled" || !result.value) continue
-      const { tag, manifest } = result.value
-
-      const layers = (
-        (manifest.layers ?? manifest.fsLayers ?? []) as Array<Record<string, unknown>>
-      ).map((l) => Number(l.size ?? 0))
-      const size = layers.reduce((a, b) => a + b, 0)
-      totalSize += size
-
-      const config = manifest.config as Record<string, unknown> | undefined
-      const configData = config as { os?: string; architecture?: string; created?: string } | undefined
-
-      metaRows.push({
-        repository: name,
-        tag,
-        digest: (manifest.config as Record<string, unknown> | undefined)?.digest as string | undefined,
-        totalSize: size,
-        os: configData?.os ?? null,
-        architecture: configData?.architecture ?? null,
-        createdAt: configData?.created ? new Date(configData.created) : null,
-        lastSyncedAt: new Date(),
-      })
-    }
+    for (const result of results) {}
   }
 
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/lib/registry-sync.ts:62:11
     )
 
     for (const result of results) {
-      if (result.status !== "fulfilled" || !result.value) continue
+      if (true) continue
       const { tag, manifest } = result.value
 
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/lib/registry-sync.ts:62:11
     )
 
     for (const result of results) {
-      if (result.status !== "fulfilled" || !result.value) continue
+      if (false) continue
       const { tag, manifest } = result.value
 
killedBy: syncRepository skips tags with non-ok manifest responses
statusReason: Cannot destructure property 'tag' of 'result.value' as it is null.

[Killed] LogicalOperator
src/lib/registry-sync.ts:67:27
 
       const layers = (
         (manifest.layers ?? manifest.fsLayers ?? []) as Array<Record<string, unknown>>
-      ).map((l) => Number(l.size ?? 0))
+      ).map((l) => Number(l.size && 0))
       const size = layers.reduce((a, b) => a + b, 0)
       totalSize += size
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected { repository: 'myrepo', …(7) } to match object { repository: 'myrepo', …(4) }
(3 matching properties omitted from actual)

[Killed] ArrowFunction
src/lib/registry-sync.ts:67:13
 
       const layers = (
         (manifest.layers ?? manifest.fsLayers ?? []) as Array<Record<string, unknown>>
-      ).map((l) => Number(l.size ?? 0))
+      ).map(() => undefined)
       const size = layers.reduce((a, b) => a + b, 0)
       totalSize += size
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected { repository: 'myrepo', …(7) } to match object { repository: 'myrepo', …(4) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/lib/registry-sync.ts:68:44
       const layers = (
         (manifest.layers ?? manifest.fsLayers ?? []) as Array<Record<string, unknown>>
       ).map((l) => Number(l.size ?? 0))
-      const size = layers.reduce((a, b) => a + b, 0)
+      const size = layers.reduce((a, b) => a - b, 0)
       totalSize += size
 
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected { repository: 'myrepo', …(7) } to match object { repository: 'myrepo', …(4) }
(3 matching properties omitted from actual)

[Killed] ArrowFunction
src/lib/registry-sync.ts:68:34
       const layers = (
         (manifest.layers ?? manifest.fsLayers ?? []) as Array<Record<string, unknown>>
       ).map((l) => Number(l.size ?? 0))
-      const size = layers.reduce((a, b) => a + b, 0)
+      const size = layers.reduce(() => undefined, 0)
       totalSize += size
 
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected { repository: 'myrepo', …(7) } to match object { repository: 'myrepo', …(4) }
(3 matching properties omitted from actual)

[Survived] AssignmentOperator
src/lib/registry-sync.ts:69:7
         (manifest.layers ?? manifest.fsLayers ?? []) as Array<Record<string, unknown>>
       ).map((l) => Number(l.size ?? 0))
       const size = layers.reduce((a, b) => a + b, 0)
-      totalSize += size
+      totalSize -= size
 
       const config = manifest.config as Record<string, unknown> | undefined

[Killed] LogicalOperator
src/lib/registry-sync.ts:79:13
         tag,
         digest: (manifest.config as Record<string, unknown> | undefined)?.digest as string | undefined,
         totalSize: size,
-        os: configData?.os ?? null,
+        os: configData?.os && null,
         architecture: configData?.architecture ?? null,
         createdAt: configData?.created ? new Date(configData.created) : null,
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected { repository: 'myrepo', …(7) } to match object { repository: 'myrepo', …(4) }
(3 matching properties omitted from actual)

[Survived] OptionalChaining
src/lib/registry-sync.ts:79:13
         tag,
         digest: (manifest.config as Record<string, unknown> | undefined)?.digest as string | undefined,
         totalSize: size,
-        os: configData?.os ?? null,
+        os: configData.os ?? null,
         architecture: configData?.architecture ?? null,
         createdAt: configData?.created ? new Date(configData.created) : null,

[Killed] LogicalOperator
src/lib/registry-sync.ts:80:23
         digest: (manifest.config as Record<string, unknown> | undefined)?.digest as string | undefined,
         totalSize: size,
         os: configData?.os ?? null,
-        architecture: configData?.architecture ?? null,
+        architecture: configData?.architecture && null,
         createdAt: configData?.created ? new Date(configData.created) : null,
         lastSyncedAt: new Date(),
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected { repository: 'myrepo', …(7) } to match object { repository: 'myrepo', …(4) }
(3 matching properties omitted from actual)

[Survived] OptionalChaining
src/lib/registry-sync.ts:80:23
         digest: (manifest.config as Record<string, unknown> | undefined)?.digest as string | undefined,
         totalSize: size,
         os: configData?.os ?? null,
-        architecture: configData?.architecture ?? null,
+        architecture: configData.architecture ?? null,
         createdAt: configData?.created ? new Date(configData.created) : null,
         lastSyncedAt: new Date(),

[Survived] OptionalChaining
src/lib/registry-sync.ts:81:20
         totalSize: size,
         os: configData?.os ?? null,
         architecture: configData?.architecture ?? null,
-        createdAt: configData?.created ? new Date(configData.created) : null,
+        createdAt: configData.created ? new Date(configData.created) : null,
         lastSyncedAt: new Date(),
       })

[Killed] EqualityOperator
src/lib/registry-sync.ts:88:7
   }
 
   // Upsert all metadata rows
-  if (metaRows.length > 0) {
+  if (metaRows.length <= 0) {
     await db
       .insert(imageMetadata)
killedBy: syncRepository skips imageMetadata upsert when no tags
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/lib/registry-sync.ts:88:28
   }
 
   // Upsert all metadata rows
-  if (metaRows.length > 0) {
-    await db
-      .insert(imageMetadata)
-      .values(metaRows)
-      .onConflictDoUpdate({
-        target: [imageMetadata.repository, imageMetadata.tag],
-        set: {
-          digest: sql`excluded.digest`,
-          totalSize: sql`excluded.total_size`,
-          os: sql`excluded.os`,
-          architecture: sql`excluded.architecture`,
-          createdAt: sql`excluded.created_at`,
-          lastSyncedAt: sql`excluded.last_synced_at`,
-        },
-      })
-  }
+  if (metaRows.length > 0) {}
 
   // Upsert repository row with fresh tag count + size
killedBy: syncRepository upserts imageMetadata rows for ok manifests with layers
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Survived] ObjectLiteral
src/lib/registry-sync.ts:92:27
     await db
       .insert(imageMetadata)
       .values(metaRows)
-      .onConflictDoUpdate({
-        target: [imageMetadata.repository, imageMetadata.tag],
-        set: {
-          digest: sql`excluded.digest`,
-          totalSize: sql`excluded.total_size`,
-          os: sql`excluded.os`,
-          architecture: sql`excluded.architecture`,
-          createdAt: sql`excluded.created_at`,
-          lastSyncedAt: sql`excluded.last_synced_at`,
-        },
-      })
+      .onConflictDoUpdate({})
   }
 

[Survived] StringLiteral
src/lib/registry-sync.ts:97:18
         set: {
           digest: sql`excluded.digest`,
           totalSize: sql`excluded.total_size`,
-          os: sql`excluded.os`,
+          os: sql``,
           architecture: sql`excluded.architecture`,
           createdAt: sql`excluded.created_at`,

[Survived] StringLiteral
src/lib/registry-sync.ts:98:28
           digest: sql`excluded.digest`,
           totalSize: sql`excluded.total_size`,
           os: sql`excluded.os`,
-          architecture: sql`excluded.architecture`,
+          architecture: sql``,
           createdAt: sql`excluded.created_at`,
           lastSyncedAt: sql`excluded.last_synced_at`,

[Killed] BlockStatement
src/lib/registry-sync.ts:116:48
 }
 
 /** Full sync: all repos + their tags. Can be slow for large registries. */
-export async function syncAll(): Promise<void> {
-  const names = await listRepositories()
-  await Promise.allSettled(names.map((name) => syncRepository(name)))
-}
+export async function syncAll(): Promise<void> {}
 
killedBy: syncAll calls syncRepository for each repo from registry
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/lib/registry-sync.ts:118:38
 /** Full sync: all repos + their tags. Can be slow for large registries. */
 export async function syncAll(): Promise<void> {
   const names = await listRepositories()
-  await Promise.allSettled(names.map((name) => syncRepository(name)))
+  await Promise.allSettled(names.map(() => undefined))
 }
 
killedBy: syncAll calls syncRepository for each repo from registry
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times
