[Killed] BlockStatement
src/lib/registry-token.ts:9:80
   scope: string
 }
 
-export async function issueRegistryToken(claims: TokenClaims): Promise<string> {
-  const rawKey = import.meta.env.REGISTRY_TOKEN_PRIVATE_KEY
-  if (!rawKey) throw new Error("REGISTRY_TOKEN_PRIVATE_KEY env var is required")
-  const privateKeyPem = rawKey.replace(/\\n/g, "\n")
-  const privateKey = await importPKCS8(privateKeyPem, "RS256")
-
-  const access = parseScopeToAccess(claims.scope)
-
-  return new SignJWT({ access, sub: claims.subject })
-    .setProtectedHeader({ alg: "RS256" })
-    .setIssuedAt()
-    .setExpirationTime("5m")
-    .setAudience(claims.service)
-    .setIssuer(import.meta.env.REGISTRY_TOKEN_ISSUER ?? "viceregistry")
-    .sign(privateKey)
-}
+export async function issueRegistryToken(claims: TokenClaims): Promise<string> {}
 
 function parseScopeToAccess(scope: string) {
killedBy: issueRegistryToken returns a signed JWT string
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BooleanLiteral
src/lib/registry-token.ts:11:7
 
 export async function issueRegistryToken(claims: TokenClaims): Promise<string> {
   const rawKey = import.meta.env.REGISTRY_TOKEN_PRIVATE_KEY
-  if (!rawKey) throw new Error("REGISTRY_TOKEN_PRIVATE_KEY env var is required")
+  if (rawKey) throw new Error("REGISTRY_TOKEN_PRIVATE_KEY env var is required")
   const privateKeyPem = rawKey.replace(/\\n/g, "\n")
   const privateKey = await importPKCS8(privateKeyPem, "RS256")
killedBy: issueRegistryToken returns a signed JWT string
statusReason: REGISTRY_TOKEN_PRIVATE_KEY env var is required

[Killed] ConditionalExpression
src/lib/registry-token.ts:11:7
 
 export async function issueRegistryToken(claims: TokenClaims): Promise<string> {
   const rawKey = import.meta.env.REGISTRY_TOKEN_PRIVATE_KEY
-  if (!rawKey) throw new Error("REGISTRY_TOKEN_PRIVATE_KEY env var is required")
+  if (true) throw new Error("REGISTRY_TOKEN_PRIVATE_KEY env var is required")
   const privateKeyPem = rawKey.replace(/\\n/g, "\n")
   const privateKey = await importPKCS8(privateKeyPem, "RS256")
killedBy: issueRegistryToken returns a signed JWT string
statusReason: REGISTRY_TOKEN_PRIVATE_KEY env var is required

[Survived] StringLiteral
src/lib/registry-token.ts:12:48
 export async function issueRegistryToken(claims: TokenClaims): Promise<string> {
   const rawKey = import.meta.env.REGISTRY_TOKEN_PRIVATE_KEY
   if (!rawKey) throw new Error("REGISTRY_TOKEN_PRIVATE_KEY env var is required")
-  const privateKeyPem = rawKey.replace(/\\n/g, "\n")
+  const privateKeyPem = rawKey.replace(/\\n/g, "")
   const privateKey = await importPKCS8(privateKeyPem, "RS256")
 

[Killed] LogicalOperator
src/lib/registry-token.ts:22:16
     .setIssuedAt()
     .setExpirationTime("5m")
     .setAudience(claims.service)
-    .setIssuer(import.meta.env.REGISTRY_TOKEN_ISSUER ?? "viceregistry")
+    .setIssuer(import.meta.env.REGISTRY_TOKEN_ISSUER && "viceregistry")
     .sign(privateKey)
 }
killedBy: issueRegistryToken uses REGISTRY_TOKEN_ISSUER env
statusReason: unexpected "iss" claim value

[Killed] BlockStatement
src/lib/registry-token.ts:26:44
     .sign(privateKey)
 }
 
-function parseScopeToAccess(scope: string) {
-  if (!scope) return []
-  const parts = scope.split(":")
-  if (parts.length < 3) return []
-  const [type, name, actionsStr] = parts
-  const actions = actionsStr.split(",").filter(Boolean)
-  return [{ type, name, actions }]
-}
+function parseScopeToAccess(scope: string) {}
 
 export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {
killedBy: issueRegistryToken produces access: [] for empty scope
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
src/lib/registry-token.ts:27:7
 }
 
 function parseScopeToAccess(scope: string) {
-  if (!scope) return []
+  if (scope) return []
   const parts = scope.split(":")
   if (parts.length < 3) return []
killedBy: issueRegistryToken parses valid scope into access array
statusReason: expected [] to deeply equal [ { type: 'repository', …(2) } ]

[Killed] ConditionalExpression
src/lib/registry-token.ts:27:7
 }
 
 function parseScopeToAccess(scope: string) {
-  if (!scope) return []
+  if (true) return []
   const parts = scope.split(":")
   if (parts.length < 3) return []
killedBy: issueRegistryToken parses valid scope into access array
statusReason: expected [] to deeply equal [ { type: 'repository', …(2) } ]

[Killed] EqualityOperator
src/lib/registry-token.ts:29:7
 function parseScopeToAccess(scope: string) {
   if (!scope) return []
   const parts = scope.split(":")
-  if (parts.length < 3) return []
+  if (parts.length <= 3) return []
   const [type, name, actionsStr] = parts
   const actions = actionsStr.split(",").filter(Boolean)
killedBy: issueRegistryToken parses valid scope into access array
statusReason: expected [] to deeply equal [ { type: 'repository', …(2) } ]

[Killed] EqualityOperator
src/lib/registry-token.ts:29:7
 function parseScopeToAccess(scope: string) {
   if (!scope) return []
   const parts = scope.split(":")
-  if (parts.length < 3) return []
+  if (parts.length >= 3) return []
   const [type, name, actionsStr] = parts
   const actions = actionsStr.split(",").filter(Boolean)
killedBy: issueRegistryToken produces access: [] for scope with fewer than 3 parts
statusReason: Cannot read properties of undefined (reading 'split')

[Survived] MethodExpression
src/lib/registry-token.ts:31:19
   const parts = scope.split(":")
   if (parts.length < 3) return []
   const [type, name, actionsStr] = parts
-  const actions = actionsStr.split(",").filter(Boolean)
+  const actions = actionsStr.split(",")
   return [{ type, name, actions }]
 }

[Killed] ObjectLiteral
src/lib/registry-token.ts:32:11
   if (parts.length < 3) return []
   const [type, name, actionsStr] = parts
   const actions = actionsStr.split(",").filter(Boolean)
-  return [{ type, name, actions }]
+  return [{}]
 }
 
killedBy: issueRegistryToken parses valid scope into access array
statusReason: expected [ {} ] to deeply equal [ { type: 'repository', …(2) } ]

[Killed] ArrayDeclaration
src/lib/registry-token.ts:32:10
   if (parts.length < 3) return []
   const [type, name, actionsStr] = parts
   const actions = actionsStr.split(",").filter(Boolean)
-  return [{ type, name, actions }]
+  return []
 }
 
killedBy: issueRegistryToken parses valid scope into access array
statusReason: expected [] to deeply equal [ { type: 'repository', …(2) } ]

[Killed] BlockStatement
src/lib/registry-token.ts:35:90
   return [{ type, name, actions }]
 }
 
-export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {
-  if (!requestedScope) return ""
-  const parts = requestedScope.split(":")
-  if (parts.length < 3) return ""
-  const [type, name, actionsStr] = parts
-  const requestedActions = actionsStr.split(",").filter(Boolean)
-
-  const isAdmin = roleNames.includes("admin")
-  const canPush = isAdmin || roleNames.includes("push")
-  const canPull = canPush || roleNames.includes("viewer")
-
-  const granted = requestedActions.filter((a) => {
-    if (a === "pull") return canPull
-    if (a === "push") return canPush
-    if (a === "*" || a === "delete") return isAdmin
-    return false
-  })
-
-  if (granted.length === 0) return ""
-  return `${type}:${name}:${granted.join(",")}`
-}
+export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {}
 
killedBy: computeGrantedScope returns empty string for empty scope
statusReason: expected undefined to be '' // Object.is equality

[Killed] BooleanLiteral
src/lib/registry-token.ts:36:7
 }
 
 export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {
-  if (!requestedScope) return ""
+  if (requestedScope) return ""
   const parts = requestedScope.split(":")
   if (parts.length < 3) return ""
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:36:7
 }
 
 export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {
-  if (!requestedScope) return ""
+  if (true) return ""
   const parts = requestedScope.split(":")
   if (parts.length < 3) return ""
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] StringLiteral
src/lib/registry-token.ts:37:38
 
 export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {
   if (!requestedScope) return ""
-  const parts = requestedScope.split(":")
+  const parts = requestedScope.split("")
   if (parts.length < 3) return ""
   const [type, name, actionsStr] = parts
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] EqualityOperator
src/lib/registry-token.ts:38:7
 export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {
   if (!requestedScope) return ""
   const parts = requestedScope.split(":")
-  if (parts.length < 3) return ""
+  if (parts.length <= 3) return ""
   const [type, name, actionsStr] = parts
   const requestedActions = actionsStr.split(",").filter(Boolean)
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:38:7
 export function computeGrantedScope(requestedScope: string, roleNames: string[]): string {
   if (!requestedScope) return ""
   const parts = requestedScope.split(":")
-  if (parts.length < 3) return ""
+  if (false) return ""
   const [type, name, actionsStr] = parts
   const requestedActions = actionsStr.split(",").filter(Boolean)
killedBy: computeGrantedScope returns empty string for scope with fewer than 3 parts
statusReason: Cannot read properties of undefined (reading 'split')

[Survived] MethodExpression
src/lib/registry-token.ts:40:28
   const parts = requestedScope.split(":")
   if (parts.length < 3) return ""
   const [type, name, actionsStr] = parts
-  const requestedActions = actionsStr.split(",").filter(Boolean)
+  const requestedActions = actionsStr.split(",")
 
   const isAdmin = roleNames.includes("admin")

[Killed] LogicalOperator
src/lib/registry-token.ts:43:19
   const requestedActions = actionsStr.split(",").filter(Boolean)
 
   const isAdmin = roleNames.includes("admin")
-  const canPush = isAdmin || roleNames.includes("push")
+  const canPush = isAdmin && roleNames.includes("push")
   const canPull = canPush || roleNames.includes("viewer")
 
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected 'repository:r:delete,*' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:43:19
   const requestedActions = actionsStr.split(",").filter(Boolean)
 
   const isAdmin = roleNames.includes("admin")
-  const canPush = isAdmin || roleNames.includes("push")
+  const canPush = false
   const canPull = canPush || roleNames.includes("viewer")
 
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected 'repository:r:delete,*' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] LogicalOperator
src/lib/registry-token.ts:44:19
 
   const isAdmin = roleNames.includes("admin")
   const canPush = isAdmin || roleNames.includes("push")
-  const canPull = canPush || roleNames.includes("viewer")
+  const canPull = canPush && roleNames.includes("viewer")
 
   const granted = requestedActions.filter((a) => {
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected 'repository:r:push,delete,*' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:44:19
 
   const isAdmin = roleNames.includes("admin")
   const canPush = isAdmin || roleNames.includes("push")
-  const canPull = canPush || roleNames.includes("viewer")
+  const canPull = true
 
   const granted = requestedActions.filter((a) => {
killedBy: computeGrantedScope no matching role grants nothing, returns empty string
statusReason: expected 'repository:r:pull' to be '' // Object.is equality

[Killed] MethodExpression
src/lib/registry-token.ts:46:19
   const canPush = isAdmin || roleNames.includes("push")
   const canPull = canPush || roleNames.includes("viewer")
 
-  const granted = requestedActions.filter((a) => {
-    if (a === "pull") return canPull
-    if (a === "push") return canPush
-    if (a === "*" || a === "delete") return isAdmin
-    return false
-  })
+  const granted = requestedActions
 
   if (granted.length === 0) return ""
killedBy: computeGrantedScope push role grants pull and push but not delete
statusReason: expected 'repository:r:pull,push,delete' to be 'repository:r:pull,push' // Object.is equality

[Killed] BlockStatement
src/lib/registry-token.ts:46:50
   const canPush = isAdmin || roleNames.includes("push")
   const canPull = canPush || roleNames.includes("viewer")
 
-  const granted = requestedActions.filter((a) => {
-    if (a === "pull") return canPull
-    if (a === "push") return canPush
-    if (a === "*" || a === "delete") return isAdmin
-    return false
-  })
+  const granted = requestedActions.filter((a) => {})
 
   if (granted.length === 0) return ""
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:47:9
   const canPull = canPush || roleNames.includes("viewer")
 
   const granted = requestedActions.filter((a) => {
-    if (a === "pull") return canPull
+    if (true) return canPull
     if (a === "push") return canPush
     if (a === "*" || a === "delete") return isAdmin
killedBy: computeGrantedScope push role grants pull and push but not delete
statusReason: expected 'repository:r:pull,push,delete' to be 'repository:r:pull,push' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:47:9
   const canPull = canPush || roleNames.includes("viewer")
 
   const granted = requestedActions.filter((a) => {
-    if (a === "pull") return canPull
+    if (false) return canPull
     if (a === "push") return canPush
     if (a === "*" || a === "delete") return isAdmin
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected 'repository:r:push,delete,*' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:48:9
 
   const granted = requestedActions.filter((a) => {
     if (a === "pull") return canPull
-    if (a === "push") return canPush
+    if (true) return canPush
     if (a === "*" || a === "delete") return isAdmin
     return false
killedBy: computeGrantedScope push role grants pull and push but not delete
statusReason: expected 'repository:r:pull,push,delete' to be 'repository:r:pull,push' // Object.is equality

[Killed] EqualityOperator
src/lib/registry-token.ts:48:9
 
   const granted = requestedActions.filter((a) => {
     if (a === "pull") return canPull
-    if (a === "push") return canPush
+    if (a !== "push") return canPush
     if (a === "*" || a === "delete") return isAdmin
     return false
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected 'repository:r:pull,delete,*' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:49:9
   const granted = requestedActions.filter((a) => {
     if (a === "pull") return canPull
     if (a === "push") return canPush
-    if (a === "*" || a === "delete") return isAdmin
+    if (true) return isAdmin
     return false
   })
killedBy: computeGrantedScope unknown action is not granted
statusReason: expected 'repository:r:write' to be '' // Object.is equality

[Killed] EqualityOperator
src/lib/registry-token.ts:49:9
   const granted = requestedActions.filter((a) => {
     if (a === "pull") return canPull
     if (a === "push") return canPush
-    if (a === "*" || a === "delete") return isAdmin
+    if (a !== "*" || a === "delete") return isAdmin
     return false
   })
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected 'repository:r:pull,push,delete' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] BooleanLiteral
src/lib/registry-token.ts:50:12
     if (a === "pull") return canPull
     if (a === "push") return canPush
     if (a === "*" || a === "delete") return isAdmin
-    return false
+    return true
   })
 
killedBy: computeGrantedScope unknown action is not granted
statusReason: expected 'repository:r:write' to be '' // Object.is equality

[Killed] EqualityOperator
src/lib/registry-token.ts:53:7
     return false
   })
 
-  if (granted.length === 0) return ""
+  if (granted.length !== 0) return ""
   return `${type}:${name}:${granted.join(",")}`
 }
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] ConditionalExpression
src/lib/registry-token.ts:53:7
     return false
   })
 
-  if (granted.length === 0) return ""
+  if (true) return ""
   return `${type}:${name}:${granted.join(",")}`
 }
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality

[Killed] StringLiteral
src/lib/registry-token.ts:54:10
   })
 
   if (granted.length === 0) return ""
-  return `${type}:${name}:${granted.join(",")}`
+  return ``
 }
 
killedBy: computeGrantedScope admin grants all actions including delete and *
statusReason: expected '' to be 'repository:r:pull,push,delete,*' // Object.is equality
