[Killed] ObjectLiteral
src/lib/validations.ts:3:37
 import { z } from "zod"
 
-export const loginSchema = z.object({
-  username: z.string().min(1).max(64),
-  password: z.string().min(1).max(256),
-})
+export const loginSchema = z.object({})
 
 export const createUserSchema = z.object({
killedBy: loginSchema rejects empty username
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:4:13
 import { z } from "zod"
 
 export const loginSchema = z.object({
-  username: z.string().min(1).max(64),
+  username: z.string().min(1).min(64),
   password: z.string().min(1).max(256),
 })
killedBy: loginSchema accepts valid credentials
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:4:13
 import { z } from "zod"
 
 export const loginSchema = z.object({
-  username: z.string().min(1).max(64),
+  username: z.string().max(1).max(64),
   password: z.string().min(1).max(256),
 })
killedBy: loginSchema accepts valid credentials
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:5:13
 
 export const loginSchema = z.object({
   username: z.string().min(1).max(64),
-  password: z.string().min(1).max(256),
+  password: z.string().max(1).max(256),
 })
 
killedBy: loginSchema accepts valid credentials
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:5:13
 
 export const loginSchema = z.object({
   username: z.string().min(1).max(64),
-  password: z.string().min(1).max(256),
+  password: z.string().min(1).min(256),
 })
 
killedBy: loginSchema accepts valid credentials
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:9:13
 })
 
 export const createUserSchema = z.object({
-  username: z
-    .string()
-    .min(2)
+  username: z.string().max(2)
     .max(64)
     .regex(/^[a-z0-9_-]+$/),
killedBy: createUserSchema accepts valid user
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:9:13
 })
 
 export const createUserSchema = z.object({
-  username: z
-    .string()
-    .min(2)
-    .max(64)
+  username: z.string().min(2).min(64)
     .regex(/^[a-z0-9_-]+$/),
   email: z.string().email(),
killedBy: createUserSchema accepts valid user
statusReason: expected false to be true // Object.is equality

[Survived] Regex
src/lib/validations.ts:13:12
     .string()
     .min(2)
     .max(64)
-    .regex(/^[a-z0-9_-]+$/),
+    .regex(/[a-z0-9_-]+$/),
   email: z.string().email(),
   password: z.string().min(8).max(256),

[Killed] MethodExpression
src/lib/validations.ts:15:13
     .max(64)
     .regex(/^[a-z0-9_-]+$/),
   email: z.string().email(),
-  password: z.string().min(8).max(256),
+  password: z.string().max(8).max(256),
   roles: z.array(z.enum(["admin", "push", "viewer"])).min(1),
 })
killedBy: createUserSchema accepts valid user
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:15:13
     .max(64)
     .regex(/^[a-z0-9_-]+$/),
   email: z.string().email(),
-  password: z.string().min(8).max(256),
+  password: z.string().min(8).min(256),
   roles: z.array(z.enum(["admin", "push", "viewer"])).min(1),
 })
killedBy: createUserSchema accepts valid user
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:16:10
     .regex(/^[a-z0-9_-]+$/),
   email: z.string().email(),
   password: z.string().min(8).max(256),
-  roles: z.array(z.enum(["admin", "push", "viewer"])).min(1),
+  roles: z.array(z.enum(["admin", "push", "viewer"])).max(1),
 })
 
killedBy: createUserSchema rejects empty roles array
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/lib/validations.ts:16:43
     .regex(/^[a-z0-9_-]+$/),
   email: z.string().email(),
   password: z.string().min(8).max(256),
-  roles: z.array(z.enum(["admin", "push", "viewer"])).min(1),
+  roles: z.array(z.enum(["admin", "push", ""])).min(1),
 })
 
killedBy: createUserSchema accepts valid user
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/validations.ts:20:11
 })
 
 export const updateUserSchema = z
-  .object({
-    email: z.string().email().optional(),
-    password: z.string().min(8).max(256).optional(),
-    isActive: z.boolean().optional(),
-    roles: z.array(z.enum(["admin", "push", "viewer"])).optional(),
-  })
+  .object({})
   .refine((d) => Object.keys(d).some((k) => d[k as keyof typeof d] !== undefined), {
     message: "At least one field must be provided",
killedBy: updateUserSchema accepts valid email update
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:22:15
 export const updateUserSchema = z
   .object({
     email: z.string().email().optional(),
-    password: z.string().min(8).max(256).optional(),
+    password: z.string().max(8).max(256).optional(),
     isActive: z.boolean().optional(),
     roles: z.array(z.enum(["admin", "push", "viewer"])).optional(),
killedBy: updateUserSchema accepts password update
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:22:15
 export const updateUserSchema = z
   .object({
     email: z.string().email().optional(),
-    password: z.string().min(8).max(256).optional(),
+    password: z.string().min(8).min(256).optional(),
     isActive: z.boolean().optional(),
     roles: z.array(z.enum(["admin", "push", "viewer"])).optional(),
killedBy: updateUserSchema accepts password update
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/validations.ts:26:38
     isActive: z.boolean().optional(),
     roles: z.array(z.enum(["admin", "push", "viewer"])).optional(),
   })
-  .refine((d) => Object.keys(d).some((k) => d[k as keyof typeof d] !== undefined), {
+  .refine((d) => Object.keys(d).some(() => undefined), {
     message: "At least one field must be provided",
   })
killedBy: updateUserSchema accepts valid email update
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/validations.ts:26:45
     isActive: z.boolean().optional(),
     roles: z.array(z.enum(["admin", "push", "viewer"])).optional(),
   })
-  .refine((d) => Object.keys(d).some((k) => d[k as keyof typeof d] !== undefined), {
+  .refine((d) => Object.keys(d).some((k) => false), {
     message: "At least one field must be provided",
   })
killedBy: updateUserSchema accepts valid email update
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:34:18
   .object({
     email: z.string().email().optional(),
     currentPassword: z.string().optional(),
-    newPassword: z.string().min(8).max(256).optional(),
+    newPassword: z.string().max(8).max(256).optional(),
   })
   .refine((d) => !d.newPassword || d.currentPassword, {
killedBy: updateSettingsSchema accepts password change with currentPassword
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/validations.ts:34:18
   .object({
     email: z.string().email().optional(),
     currentPassword: z.string().optional(),
-    newPassword: z.string().min(8).max(256).optional(),
+    newPassword: z.string().min(8).min(256).optional(),
   })
   .refine((d) => !d.newPassword || d.currentPassword, {
killedBy: updateSettingsSchema accepts password change with currentPassword
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/validations.ts:36:18
     currentPassword: z.string().optional(),
     newPassword: z.string().min(8).max(256).optional(),
   })
-  .refine((d) => !d.newPassword || d.currentPassword, {
+  .refine((d) => d.newPassword || d.currentPassword, {
     message: "currentPassword required to set newPassword",
   })
killedBy: updateSettingsSchema accepts email-only update
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/validations.ts:36:11
     currentPassword: z.string().optional(),
     newPassword: z.string().min(8).max(256).optional(),
   })
-  .refine((d) => !d.newPassword || d.currentPassword, {
+  .refine(() => undefined, {
     message: "currentPassword required to set newPassword",
   })
killedBy: updateSettingsSchema accepts email-only update
statusReason: expected false to be true // Object.is equality
