[Killed] ArrayDeclaration
src/middleware/index.ts:5:23
 import { verifySessionToken } from "@/lib/auth"
 
 // No auth required at all
-const PUBLIC_ROUTES = [
-  "/login",
-  "/dashboard",
-  "/repository",
-  "/image",
-  "/api/auth/login",
-  "/api/auth/token",
-  "/api/health",
-  "/api/search",
-]
+const PUBLIC_ROUTES = []
 
 // Admin only
killedBy: middleware public routes calls next() with no session on /login
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/middleware/index.ts:6:3
 
 // No auth required at all
 const PUBLIC_ROUTES = [
-  "/login",
+  "",
   "/dashboard",
   "/repository",
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 200 to be 401 // Object.is equality

[Killed] StringLiteral
src/middleware/index.ts:8:3
 const PUBLIC_ROUTES = [
   "/login",
   "/dashboard",
-  "/repository",
+  "",
   "/image",
   "/api/auth/login",
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 200 to be 401 // Object.is equality

[Killed] StringLiteral
src/middleware/index.ts:10:3
   "/dashboard",
   "/repository",
   "/image",
-  "/api/auth/login",
+  "",
   "/api/auth/token",
   "/api/health",
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 200 to be 401 // Object.is equality

[Killed] StringLiteral
src/middleware/index.ts:11:3
   "/repository",
   "/image",
   "/api/auth/login",
-  "/api/auth/token",
+  "",
   "/api/health",
   "/api/search",
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 200 to be 401 // Object.is equality

[Killed] StringLiteral
src/middleware/index.ts:13:3
   "/api/auth/login",
   "/api/auth/token",
   "/api/health",
-  "/api/search",
+  "",
 ]
 
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 200 to be 401 // Object.is equality

[Survived] StringLiteral
src/middleware/index.ts:20:37
 const ADMIN_PREFIXES = ["/admin", "/api/users"]
 
 // Auth required (but not admin)
-const AUTH_PREFIXES = ["/settings", "/api/auth/logout", "/api/auth/me"]
+const AUTH_PREFIXES = ["/settings", "", "/api/auth/me"]
 
 export const onRequest = defineMiddleware(async (context, next) => {

[Survived] StringLiteral
src/middleware/index.ts:20:57
 const ADMIN_PREFIXES = ["/admin", "/api/users"]
 
 // Auth required (but not admin)
-const AUTH_PREFIXES = ["/settings", "/api/auth/logout", "/api/auth/me"]
+const AUTH_PREFIXES = ["/settings", "/api/auth/logout", ""]
 
 export const onRequest = defineMiddleware(async (context, next) => {

[Killed] MethodExpression
src/middleware/index.ts:25:20
 export const onRequest = defineMiddleware(async (context, next) => {
   const { pathname } = context.url
 
-  const isPublic = PUBLIC_ROUTES.some(
-    (r) => pathname === r || pathname.startsWith(r + "/"),
-  )
+  const isPublic = PUBLIC_ROUTES.every(r => pathname === r || pathname.startsWith(r + "/"))
 
   // Try to attach user from session cookie on every request (best-effort)
killedBy: middleware public routes calls next() with no session on /login
statusReason: expected "vi.fn()" to be called at least once

[Killed] LogicalOperator
src/middleware/index.ts:26:12
   const { pathname } = context.url
 
   const isPublic = PUBLIC_ROUTES.some(
-    (r) => pathname === r || pathname.startsWith(r + "/"),
+    (r) => pathname === r && pathname.startsWith(r + "/"),
   )
 
killedBy: middleware public routes calls next() with no session on /login
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/middleware/index.ts:26:12
   const { pathname } = context.url
 
   const isPublic = PUBLIC_ROUTES.some(
-    (r) => pathname === r || pathname.startsWith(r + "/"),
+    (r) => false,
   )
 
killedBy: middleware public routes calls next() with no session on /login
statusReason: expected "vi.fn()" to be called at least once

[Killed] OptionalChaining
src/middleware/index.ts:30:24
   )
 
   // Try to attach user from session cookie on every request (best-effort)
-  const sessionToken = context.cookies.get("session")?.value
+  const sessionToken = context.cookies.get("session").value
   if (sessionToken) {
     try {
killedBy: middleware public routes calls next() with no session on /login
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/middleware/index.ts:31:7
 
   // Try to attach user from session cookie on every request (best-effort)
   const sessionToken = context.cookies.get("session")?.value
-  if (sessionToken) {
+  if (false) {
     try {
       context.locals.user = await verifySessionToken(sessionToken)
killedBy: middleware public routes attaches user from valid session on public route /dashboard
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/middleware/index.ts:31:21
 
   // Try to attach user from session cookie on every request (best-effort)
   const sessionToken = context.cookies.get("session")?.value
-  if (sessionToken) {
-    try {
-      context.locals.user = await verifySessionToken(sessionToken)
-    } catch {
-      context.cookies.delete("session", { path: "/" })
-    }
-  }
+  if (sessionToken) {}
 
   if (isPublic) return next()
killedBy: middleware public routes attaches user from valid session on public route /dashboard
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/middleware/index.ts:32:9
   // Try to attach user from session cookie on every request (best-effort)
   const sessionToken = context.cookies.get("session")?.value
   if (sessionToken) {
-    try {
-      context.locals.user = await verifySessionToken(sessionToken)
-    } catch {
+    try {} catch {
       context.cookies.delete("session", { path: "/" })
     }
killedBy: middleware public routes attaches user from valid session on public route /dashboard
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/middleware/index.ts:34:13
   if (sessionToken) {
     try {
       context.locals.user = await verifySessionToken(sessionToken)
-    } catch {
-      context.cookies.delete("session", { path: "/" })
-    }
+    } catch {}
   }
 
killedBy: middleware public routes clears cookie on invalid session token on public route
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', { path: '/' } ]

Number of calls: 0

[Killed] StringLiteral
src/middleware/index.ts:35:30
     try {
       context.locals.user = await verifySessionToken(sessionToken)
     } catch {
-      context.cookies.delete("session", { path: "/" })
+      context.cookies.delete("", { path: "/" })
     }
   }
killedBy: middleware public routes clears cookie on invalid session token on public route
statusReason: expected "vi.fn()" to be called with arguments: [ 'session', { path: '/' } ]

Received:

  1st vi.fn() call:

  [
-   "session",

[Killed] ConditionalExpression
src/middleware/index.ts:39:7
     }
   }
 
-  if (isPublic) return next()
+  if (true) return next()
 
   // DELETE /api/registry/* requires admin
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/middleware/index.ts:39:7
     }
   }
 
-  if (isPublic) return next()
+  if (false) return next()
 
   // DELETE /api/registry/* requires admin
killedBy: middleware public routes calls next() with no session on /login
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/middleware/index.ts:42:7
   if (isPublic) return next()
 
   // DELETE /api/registry/* requires admin
-  if (pathname.startsWith("/api/registry/") && context.request.method === "DELETE") {
+  if (true) {
     if (!context.locals.user?.roles.includes("admin")) {
       return new Response(JSON.stringify({ error: "Forbidden" }), {
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 'Forbidden' to be 'Unauthorized' // Object.is equality

[Killed] EqualityOperator
src/middleware/index.ts:42:48
   if (isPublic) return next()
 
   // DELETE /api/registry/* requires admin
-  if (pathname.startsWith("/api/registry/") && context.request.method === "DELETE") {
+  if (pathname.startsWith("/api/registry/") && context.request.method !== "DELETE") {
     if (!context.locals.user?.roles.includes("admin")) {
       return new Response(JSON.stringify({ error: "Forbidden" }), {
killedBy: middleware DELETE /api/registry/* returns 403 when non-admin user
statusReason: expected 200 to be 403 // Object.is equality

[Killed] BlockStatement
src/middleware/index.ts:43:56
 
   // DELETE /api/registry/* requires admin
   if (pathname.startsWith("/api/registry/") && context.request.method === "DELETE") {
-    if (!context.locals.user?.roles.includes("admin")) {
-      return new Response(JSON.stringify({ error: "Forbidden" }), {
-        status: context.locals.user ? 403 : 401,
-        headers: { "Content-Type": "application/json" },
-      })
-    }
+    if (!context.locals.user?.roles.includes("admin")) {}
     return next()
   }
killedBy: middleware DELETE /api/registry/* returns 401 when no user
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/middleware/index.ts:43:9
 
   // DELETE /api/registry/* requires admin
   if (pathname.startsWith("/api/registry/") && context.request.method === "DELETE") {
-    if (!context.locals.user?.roles.includes("admin")) {
+    if (false) {
       return new Response(JSON.stringify({ error: "Forbidden" }), {
         status: context.locals.user ? 403 : 401,
killedBy: middleware DELETE /api/registry/* returns 401 when no user
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ObjectLiteral
src/middleware/index.ts:44:67
   // DELETE /api/registry/* requires admin
   if (pathname.startsWith("/api/registry/") && context.request.method === "DELETE") {
     if (!context.locals.user?.roles.includes("admin")) {
-      return new Response(JSON.stringify({ error: "Forbidden" }), {
-        status: context.locals.user ? 403 : 401,
-        headers: { "Content-Type": "application/json" },
-      })
+      return new Response(JSON.stringify({ error: "Forbidden" }), {})
     }
     return next()
killedBy: middleware DELETE /api/registry/* returns 401 when no user
statusReason: expected 200 to be 401 // Object.is equality

[Survived] StringLiteral
src/middleware/index.ts:44:51
   // DELETE /api/registry/* requires admin
   if (pathname.startsWith("/api/registry/") && context.request.method === "DELETE") {
     if (!context.locals.user?.roles.includes("admin")) {
-      return new Response(JSON.stringify({ error: "Forbidden" }), {
+      return new Response(JSON.stringify({ error: "" }), {
         status: context.locals.user ? 403 : 401,
         headers: { "Content-Type": "application/json" },

[Survived] StringLiteral
src/middleware/index.ts:46:36
     if (!context.locals.user?.roles.includes("admin")) {
       return new Response(JSON.stringify({ error: "Forbidden" }), {
         status: context.locals.user ? 403 : 401,
-        headers: { "Content-Type": "application/json" },
+        headers: { "Content-Type": "" },
       })
     }

[Killed] ConditionalExpression
src/middleware/index.ts:53:7
   }
 
   // Remaining auth-required routes
-  if (!context.locals.user) {
+  if (true) {
     if (pathname.startsWith("/api/")) {
       return new Response(JSON.stringify({ error: "Unauthorized" }), {
killedBy: middleware admin-only routes returns 403 JSON for non-admin on /api/users
statusReason: expected 401 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/middleware/index.ts:53:7
   }
 
   // Remaining auth-required routes
-  if (!context.locals.user) {
+  if (false) {
     if (pathname.startsWith("/api/")) {
       return new Response(JSON.stringify({ error: "Unauthorized" }), {
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/middleware/index.ts:54:9
 
   // Remaining auth-required routes
   if (!context.locals.user) {
-    if (pathname.startsWith("/api/")) {
+    if (true) {
       return new Response(JSON.stringify({ error: "Unauthorized" }), {
         status: 401,
killedBy: middleware unauthenticated access to protected routes redirects to /login for unauthenticated page request
statusReason: expected "vi.fn()" to be called with arguments: [ '/login' ]

Number of calls: 0

[Killed] BlockStatement
src/middleware/index.ts:54:39
 
   // Remaining auth-required routes
   if (!context.locals.user) {
-    if (pathname.startsWith("/api/")) {
-      return new Response(JSON.stringify({ error: "Unauthorized" }), {
-        status: 401,
-        headers: { "Content-Type": "application/json" },
-      })
-    }
+    if (pathname.startsWith("/api/")) {}
     return context.redirect("/login")
   }
killedBy: middleware unauthenticated access to protected routes returns 401 JSON for unauthenticated API request
statusReason: expected 302 to be 401 // Object.is equality

[Survived] ObjectLiteral
src/middleware/index.ts:57:18
     if (pathname.startsWith("/api/")) {
       return new Response(JSON.stringify({ error: "Unauthorized" }), {
         status: 401,
-        headers: { "Content-Type": "application/json" },
+        headers: {},
       })
     }

[Killed] StringLiteral
src/middleware/index.ts:60:29
         headers: { "Content-Type": "application/json" },
       })
     }
-    return context.redirect("/login")
+    return context.redirect("")
   }
 
killedBy: middleware unauthenticated access to protected routes redirects to /login for unauthenticated page request
statusReason: expected "vi.fn()" to be called with arguments: [ '/login' ]

Received:

  1st vi.fn() call:

  [
-   "/login",

[Killed] ConditionalExpression
src/middleware/index.ts:64:7
   }
 
   // Admin guard
-  if (ADMIN_PREFIXES.some((p) => pathname === p || pathname.startsWith(p + "/"))) {
+  if (false) {
     if (!context.locals.user.roles.includes("admin")) {
       if (pathname.startsWith("/api/")) {
killedBy: middleware admin-only routes returns 403 JSON for non-admin on /api/users
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/middleware/index.ts:64:7
   }
 
   // Admin guard
-  if (ADMIN_PREFIXES.some((p) => pathname === p || pathname.startsWith(p + "/"))) {
+  if (true) {
     if (!context.locals.user.roles.includes("admin")) {
       if (pathname.startsWith("/api/")) {
killedBy: middleware auth-required non-admin routes calls next() for authenticated user on /settings
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/middleware/index.ts:65:55
 
   // Admin guard
   if (ADMIN_PREFIXES.some((p) => pathname === p || pathname.startsWith(p + "/"))) {
-    if (!context.locals.user.roles.includes("admin")) {
-      if (pathname.startsWith("/api/")) {
-        return new Response(JSON.stringify({ error: "Forbidden" }), {
-          status: 403,
-          headers: { "Content-Type": "application/json" },
-        })
-      }
-      return context.redirect("/dashboard")
-    }
+    if (!context.locals.user.roles.includes("admin")) {}
   }
 
killedBy: middleware admin-only routes returns 403 JSON for non-admin on /api/users
statusReason: expected 200 to be 403 // Object.is equality

[Killed] BooleanLiteral
src/middleware/index.ts:65:9
 
   // Admin guard
   if (ADMIN_PREFIXES.some((p) => pathname === p || pathname.startsWith(p + "/"))) {
-    if (!context.locals.user.roles.includes("admin")) {
+    if (context.locals.user.roles.includes("admin")) {
       if (pathname.startsWith("/api/")) {
         return new Response(JSON.stringify({ error: "Forbidden" }), {
killedBy: middleware admin-only routes returns 403 JSON for non-admin on /api/users
statusReason: expected 200 to be 403 // Object.is equality

[Killed] BlockStatement
src/middleware/index.ts:66:41
   // Admin guard
   if (ADMIN_PREFIXES.some((p) => pathname === p || pathname.startsWith(p + "/"))) {
     if (!context.locals.user.roles.includes("admin")) {
-      if (pathname.startsWith("/api/")) {
-        return new Response(JSON.stringify({ error: "Forbidden" }), {
-          status: 403,
-          headers: { "Content-Type": "application/json" },
-        })
-      }
+      if (pathname.startsWith("/api/")) {}
       return context.redirect("/dashboard")
     }
killedBy: middleware admin-only routes returns 403 JSON for non-admin on /api/users
statusReason: expected 302 to be 403 // Object.is equality

[Killed] MethodExpression
src/middleware/index.ts:66:11
   // Admin guard
   if (ADMIN_PREFIXES.some((p) => pathname === p || pathname.startsWith(p + "/"))) {
     if (!context.locals.user.roles.includes("admin")) {
-      if (pathname.startsWith("/api/")) {
+      if (pathname.endsWith("/api/")) {
         return new Response(JSON.stringify({ error: "Forbidden" }), {
           status: 403,
killedBy: middleware admin-only routes returns 403 JSON for non-admin on /api/users
statusReason: expected 302 to be 403 // Object.is equality

[Killed] StringLiteral
src/middleware/index.ts:67:53
   if (ADMIN_PREFIXES.some((p) => pathname === p || pathname.startsWith(p + "/"))) {
     if (!context.locals.user.roles.includes("admin")) {
       if (pathname.startsWith("/api/")) {
-        return new Response(JSON.stringify({ error: "Forbidden" }), {
+        return new Response(JSON.stringify({ error: "" }), {
           status: 403,
           headers: { "Content-Type": "application/json" },
killedBy: middleware admin-only routes returns 403 JSON for non-admin on /api/users
statusReason: expected '' to be 'Forbidden' // Object.is equality

[Survived] StringLiteral
src/middleware/index.ts:69:38
       if (pathname.startsWith("/api/")) {
         return new Response(JSON.stringify({ error: "Forbidden" }), {
           status: 403,
-          headers: { "Content-Type": "application/json" },
+          headers: { "Content-Type": "" },
         })
       }

[Survived] ObjectLiteral
src/middleware/index.ts:69:20
       if (pathname.startsWith("/api/")) {
         return new Response(JSON.stringify({ error: "Forbidden" }), {
           status: 403,
-          headers: { "Content-Type": "application/json" },
+          headers: {},
         })
       }
